package com.example.please.constant;

public interface Constance {

    String START_NEW_USER = "Вітаю! Я бот, який буде фіксувати Вас та інших працівників " +
            "знаходитесь Ви на робочому місці чи ні. Зараз треба  пройти невелику реєстрація, але вести " +
            "своє ПІБ та відділ, в якому працюєте. Спочатку ведіть ПІБ (наприклад: ПІБ: Іванов Іван Іванович).";
    String START_OLD_USER = ", Ви вже реєстровані";
    String HELP = "У бота є меню, яке складається з:\n" +
            "\t/start – початок роботи з ботом\n" +
            "\tПароль … - конвертер для пароля (приклад вводу: Пароль сом34ДОМА)\n" +
            "\t/mydata – показує Ваші дані (username, ПІБ, відділ)\n" +
            "\tПІБ: … - ведення ПІБ\n" +
            "\tВідділ: … - ведення відділу\n" +
            "Також є кнопки такі, як:\n" +
            "\tНа місці – підтвердження того, що Ви на роботі \n" +
            "\tСписок працівників – список робітників, які на роботі\n";
    String FULL_NAME = ", переходимо до другого кроку. Ведіть свій відділ (наприклад: " +
           "Відділ: Обслуговування).";
    String FULL_NAME_NEW = "Ви змінили своє ПІБ на ";
    String DEPARTURE = "Дякую за реєстрацію! На даній версії бота (version 1.0) доступно пока що " +
            "пару дій. Більш детальнішої інформації використовуйте /help ";
    String DEPARTURE_NEW = "Ви змінили свій відділ на ";
  //  private final String INFO = "";
  //  private final String AT_WORK = "";
  //  private final String LIST = "";
  //  private final String CONVERTER = "";
}
