package com.example.please.constant;

public interface Constance {

    String START_NEW_USER = "Я бот, який буде фіксувати Вас та інших працівників, " +
            "знаходитесь Ви на робочому місці чи ні. Спершу треба пройти реєстрацію. Вона " +
            "складається з двох кроків.\n1 крок: введеня ПІБ (наприклад: ПІБ: Іванченко " +
            "Іван Іванович)";
    String START_OLD_USER = ", Ви вже реєстровані";
    String HELP = "/mydata – показує Ваші дані (username, ПІБ, відділ)\n" +
            "/help - показує всі доступні команди\n" +
            "/mypassword - показує Ваш пароль\n" +
            "ПІБ: … - ведення ПІБ\n" +
            "Відділ: … - ведення відділу\n" +
            "Пароль … - конвертер для пароля (приклад вводу: Пароль сом8ДОМЕ)\n" +
            "На місці – підтвердження того, що Ви на роботі \n" +
            "Список працівників – список робітників, які на роботі";
    String FULL_NAME = "2 крок: введить відділ, в якому працюєте (наприклад: Відділ:" +
            " Бухгалтерія)";
    String FULL_NAME_NEW = "Ви змінили своє ПІБ на ";
    String DEPARTURE = "Дякую за реєстрацію! Це рання версія боту, тому доступно поки що декілька" +
            " дій. Для того, щоб дізнатися, які дії на даний час доступні скористатися командою" +
            " /help ";
    String DEPARTURE_NEW = "Ви змінили свій відділ на ";

}
