package com.example.please.constant;

public interface Phrases {

    String START_NEW_USER = "Ну, привіт! Я бот, який буде фіксувати Вас та інших працівників, " +
            "знаходитесь Ви на робочому місці чи ні але спочатку треба ввести своє ПІБ.";

    String HELP = "/myfullname – показує Ваш ПІБ\n" +
            "/help - показує всі доступні команди\n" +
            "/mypassword - показує Ваш пароль\n" +
            "/room - показує кабінет у якому Ви працюєте\n" +
            "/phone_number - показує Ваш номер телефону\n" +
            "На місці – підтвердження того, що Ви на роботі \n" +
            "Список працівників – список робітників, які на роботі\n" +
            "І на останок можно конвертувати пароль з російської розкладнки на англійську просто написавши її";
    String FULL_NAME = "Дякую! Це рання версія (version 1.1) боту, тому доступно поки що декілька дій. " +
            "Для того, щоб дізнатися, які дії є скористайтися командою /help";
    String FULL_NAME_NEW = "Тепер Ви ";

    String START_OLD_USER = "Дорогуша, Ви вже зареєстровані!";

    String ROOM = "На даний час Ви працюєте на вулиці. Якщо ні, то введить кабинеть у якому працюєте (наприклад 666)";
    String PHONE_NUMBER = "У базі не має Вашого телефому, тому введить свой робочий номер телефону (наприклад +380663332211)";

}
